"""
1. Проверка имен
Даны несколько списков.
Вводится имя, программа ищет его в списках.
"""

serbian = ['Никола', 'Лука', 'Стефан', 'Марко', 'Лазар', 'Александр',
           'Филип', 'Йован', 'Неманя', 'Милош', 'Душан']
kazakh = ['Муртаза', 'Меджит', 'Ильяс', 'Харун', 'Нурадил', 'Айрат', 'Азиль', 'Ерлан']
yakutian = ['Айхал', 'Эркин', 'Хорула', 'Уруй', 'Дуолан', 'Дохсун', 'Тимир']

name = input("Введите имя: ")

if name in serbian:
    print('это имя сербское')
elif name in kazakh:
    print('это имя казахское')
elif name in yakutian:
    print('это имя якутское')
else:
    print('такого имени нет')
